// # Category
// # 575 records, results must match as close as possible
cats = {
  "інвалідність": 15,
  "инвалид": 66,
  "инвалидность": 46,
  "інвалід": 50,
  "дитина інвалід": 1,
  "инвалидность": 46,             // # 1

  "переселенці": 15,
  "ТПО": 3,
  "впо": 78,                      // # 2

  "многодетная": 12,
  "багатодітна": 17,              // # 3

  "втратили годувальника": 0,     // # 4


  "один годувальник": 1,
  "мама-одиночка": 5,
  "мати-одиначка": 2,             // # 5

  "пенсионерка": 69,
  "пенсіонерка": 72,
  "пенсіонер": 101,
  "пенсионер": 3,                 // # 6

  "літні люди (75+)": 14,          // # 7

  // Родини військовослужбовців
  "плену": 0,
  "полоні": 0,
  "служит": 0,
  "погиб": 0,
  "в зсу": 0,
  "загинув": 0,
  "загинула": 0,

  "зсу": 1,
  "всу": 0
}

raw_cats = 0;
i = 0;
for (k in cats) {
  i = i + cats[k];
  raw_cats++;
}

recs = 575;
in_cats = 575 - i;

cats_accuracy = 100 - in_cats / recs * 100;

console.log('Всього "сирих" категорій:', raw_cats);
console.log('Всього "загальних" категорій:', 8);
console.log('Категоризація можлива для відсотку заявок:', Number(cats_accuracy.toFixed(2)), '%');
